## Lesson 11 - Pandas Basics

In this lesson we will cover some basic features of [Pandas](http://pandas.pydata.org):

* Series
* DataFrame
* index, columns
* dtypes, info, describe
* read_csv
* head, tail
* Indexing with bracket/dot notation, loc, iloc
* transpose
* to_csv
* read_csv
* to_datetime

In [1]:
import pandas as pd
import numpy as np

### Series

In [2]:
# a list of strings
my_list = ['cubs', 'pirates', 'giants', 'yankees', 'donkeys']
my_list

['cubs', 'pirates', 'giants', 'yankees', 'donkeys']

In [3]:
# pandas Series from list
series_from_list = pd.Series(my_list)
series_from_list

0       cubs
1    pirates
2     giants
3    yankees
4    donkeys
dtype: object

In [4]:
# indexing a Series is similar to lists and arrays
series_from_list[3]

'yankees'

In [5]:
# a numpy array
my_array = np.random.rand(5)
my_array

array([0.85058368, 0.14409356, 0.61137369, 0.72222878, 0.33126519])

In [6]:
# pandas Series from array
series_from_array = pd.Series(my_array)
series_from_array

0    0.850584
1    0.144094
2    0.611374
3    0.722229
4    0.331265
dtype: float64

In [7]:
# indexing also supports slices
series_from_array[3:]

3    0.722229
4    0.331265
dtype: float64

### DataFrame

#### 2D array to DataFrame

In [8]:
# create a 2D numpy array
my_2d_array = np.random.randn(5,5)
my_2d_array

array([[ 0.65706812,  0.5324236 ,  1.00526824, -0.39678434,  0.2358571 ],
       [-1.92435476, -0.79444487, -0.54088151,  0.8591536 ,  0.59140396],
       [-0.25122306, -1.17716775,  0.31885593,  0.23834334, -1.17730632],
       [ 0.09105878,  1.45544338, -0.92711236,  1.05276823, -0.88787613],
       [-0.45652184, -2.28293916,  0.00643336, -0.86689351, -0.48956187]])

In [9]:
# make a DataFrame from the 2D numpy array
pd.DataFrame(my_2d_array)

          0         1         2         3         4
0  0.657068  0.532424  1.005268 -0.396784  0.235857
1 -1.924355 -0.794445 -0.540882  0.859154  0.591404
2 -0.251223 -1.177168  0.318856  0.238343 -1.177306
3  0.091059  1.455443 -0.927112  1.052768 -0.887876
4 -0.456522 -2.282939  0.006433 -0.866894 -0.489562

In [10]:
# we can set the index and column labels when we create the DataFrame
df_from_2d_array = pd.DataFrame(my_2d_array, 
                                index=['row1', 'row2', 'row3', 'row4', 'row5'], 
                                columns=['col1', 'col2', 'col3', 'col4', 'col5'])
df_from_2d_array

          col1      col2      col3      col4      col5
row1  0.657068  0.532424  1.005268 -0.396784  0.235857
row2 -1.924355 -0.794445 -0.540882  0.859154  0.591404
row3 -0.251223 -1.177168  0.318856  0.238343 -1.177306
row4  0.091059  1.455443 -0.927112  1.052768 -0.887876
row5 -0.456522 -2.282939  0.006433 -0.866894 -0.489562

#### List or Series to DataFrame

In [11]:
# method 1: getting data as a list of series will orient them as rows
x = pd.DataFrame(data=[series_from_list, series_from_array])
x

          0         1         2         3         4
0      cubs   pirates    giants   yankees   donkeys
1  0.850584  0.144094  0.611374  0.722229  0.331265

In [12]:
# we can transpose a DataFrame using T or transpose
x.T

         0         1
0     cubs  0.850584
1  pirates  0.144094
2   giants  0.611374
3  yankees  0.722229
4  donkeys  0.331265

In [13]:
x.transpose()

         0         1
0     cubs  0.850584
1  pirates  0.144094
2   giants  0.611374
3  yankees  0.722229
4  donkeys  0.331265

In [14]:
# method 2: pass list/Series as value of dictionary
y = pd.DataFrame({'a': series_from_list, 'b': series_from_array}, dtype=str)
y

         a                   b
0     cubs  0.8505836838546484
1  pirates  0.1440935601198564
2   giants  0.6113736862709616
3  yankees  0.7222287762749056
4  donkeys  0.3312651916784777

In [15]:
# method 3: use pd.concat to combine series in column orientation
df = pd.concat([series_from_list, series_from_array], axis=1)
df

         0         1
0     cubs  0.850584
1  pirates  0.144094
2   giants  0.611374
3  yankees  0.722229
4  donkeys  0.331265

### index, columns

In [16]:
# set the index and column names to an existing DataFrame
df.index = ['a', 'b', 'c', 'd', 'e']
df.columns = ['team', 'random']
df

      team    random
a     cubs  0.850584
b  pirates  0.144094
c   giants  0.611374
d  yankees  0.722229
e  donkeys  0.331265

In [17]:
# add a new column to the DataFrame
df['integers'] = [2, 3, 5, 8, 13]
df

      team    random  integers
a     cubs  0.850584         2
b  pirates  0.144094         3
c   giants  0.611374         5
d  yankees  0.722229         8
e  donkeys  0.331265        13

### dtypes, info, describe

In [18]:
# gives the datatype of each column
df.dtypes

team         object
random      float64
integers      int64
dtype: object

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 3 columns):
team        5 non-null object
random      5 non-null float64
integers    5 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [20]:
df.describe()

         random   integers
count  5.000000   5.000000
mean   0.531909   6.200000
std    0.289287   4.438468
min    0.144094   2.000000
25%    0.331265   3.000000
50%    0.611374   5.000000
75%    0.722229   8.000000
max    0.850584  13.000000

### read_csv

In [21]:
# by default column headers are the first row and row indexes are integers starting from zero
df_sio = pd.read_csv('../data/scripps_pier_20151110.csv')

In [22]:
# by default, read_csv will infer the object types
df_sio.dtypes

Date            object
chl (ug/L)     float64
pres (dbar)    float64
sal (PSU)      float64
temp (C)       float64
dtype: object

In [23]:
df_sio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 5 columns):
Date           66 non-null object
chl (ug/L)     66 non-null float64
pres (dbar)    66 non-null float64
sal (PSU)      66 non-null float64
temp (C)       66 non-null float64
dtypes: float64(4), object(1)
memory usage: 2.7+ KB

In [24]:
df_sio.describe()

       chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
count   66.000000    66.000000  66.000000  66.00000
mean    22.349576     3.041818  33.199318  20.06697
std      0.038988     0.254295   0.004959   0.06850
min     22.305000     2.714000  33.184000  19.94000
25%     22.319000     2.813250  33.197000  20.04000
50%     22.333500     2.997000  33.199000  20.07000
75%     22.385000     3.215500  33.203000  20.10500
max     22.426000     3.712000  33.206000  20.19000

In [25]:
# we can also specify the dtype (and specify index and header to defaults)
# sometimes it's better to specify the dtype as object and convert to int, float, etc. later
df_sio = pd.read_csv('../data/scripps_pier_20151110.csv', dtype=object, index_col=None, header=0)

In [26]:
df_sio.dtypes

Date           object
chl (ug/L)     object
pres (dbar)    object
sal (PSU)      object
temp (C)       object
dtype: object

#### Changing dtype of columns

In [27]:
# method 1: list comprehension (one column)
df_sio['chl (ug/L)'] = [float(x) for x in df_sio['chl (ug/L)']]

In [28]:
# method 2: pd.to_numeric (one column)
df_sio['pres (dbar)'] = pd.to_numeric(df_sio['pres (dbar)'])

In [29]:
# method 3: apply(pd.to_numeric) (multiple columns)
df_sio[['sal (PSU)','temp (C)']] = df_sio[['sal (PSU)','temp (C)']].apply(pd.to_numeric)

In [30]:
df_sio.dtypes

Date            object
chl (ug/L)     float64
pres (dbar)    float64
sal (PSU)      float64
temp (C)       float64
dtype: object

### head, tail

In [31]:
# add a number to change the number of rows printed
df_sio.head(7)

            Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
0  11/10/15 1:42      22.307        3.712     33.199     19.95
1  11/10/15 1:35      22.311        3.588     33.201     19.94
2  11/10/15 1:29      22.305        3.541     33.200     19.95
3  11/10/15 1:23      22.323        3.463     33.200     19.95
4  11/10/15 1:17      22.316        3.471     33.199     19.95
5  11/10/15 1:11      22.315        3.476     33.198     19.95
6  11/10/15 1:05      22.310        3.448     33.199     19.96

In [32]:
# tail works the same way
df_sio.tail(3)

             Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
63  11/9/15 19:22      22.418        3.316     33.202     19.96
64  11/9/15 19:16      22.410        3.209     33.200     19.96
65  11/9/15 19:10      22.426        3.328     33.203     19.95

### Indexing with bracket/dot notation, loc, iloc

Pandas has three indexing methods:

* `[ ]` and `.` work on labels of columns
* `.loc` works on labels of indexes
* `.iloc` works on the positions of indexes (so it only takes integers)

In [33]:
df

      team    random  integers
a     cubs  0.850584         2
b  pirates  0.144094         3
c   giants  0.611374         5
d  yankees  0.722229         8
e  donkeys  0.331265        13

#### brackets only -- column by header

In [34]:
# to get a column (Series), use the column header (don't need .loc, .iloc, or .ix)
df['team']

a       cubs
b    pirates
c     giants
d    yankees
e    donkeys
Name: team, dtype: object

In [35]:
# for multiple columns, put a list inside the brackets (so two sets of brackets)
df[['team', 'random']]

      team    random
a     cubs  0.850584
b  pirates  0.144094
c   giants  0.611374
d  yankees  0.722229
e  donkeys  0.331265

#### dot-notation

In [36]:
# if the column name has only alpha-numerics, we can use a dot instead of brackets and quotes
df.team

a       cubs
b    pirates
c     giants
d    yankees
e    donkeys
Name: team, dtype: object

#### loc -- row by index

In [37]:
# to get a row by name, use .loc with the row index
df.loc['a']

team            cubs
random      0.850584
integers           2
Name: a, dtype: object

In [38]:
# for multiple rows, put a list inside the brackets (so two sets of brackets)
df.loc[['a', 'd']]

      team    random  integers
a     cubs  0.850584         2
d  yankees  0.722229         8

#### iloc -- row (or column) by position

In [39]:
# to get a row by position, use .iloc with the row number
df.iloc[0]

team            cubs
random      0.850584
integers           2
Name: a, dtype: object

In [40]:
# for multiple rows, put a list inside the brackets (so two sets of brackets)
df.iloc[[0, 3]]

      team    random  integers
a     cubs  0.850584         2
d  yankees  0.722229         8

In [41]:
# or pass a slice
df.iloc[2:]

      team    random  integers
c   giants  0.611374         5
d  yankees  0.722229         8
e  donkeys  0.331265        13

In [42]:
# iloc also works with columns
df.iloc[:, [0, 2]]

      team  integers
a     cubs         2
b  pirates         3
c   giants         5
d  yankees         8
e  donkeys        13

### transpose

In [43]:
df.transpose()

                 a         b         c         d         e
team          cubs   pirates    giants   yankees   donkeys
random    0.850584  0.144094  0.611374  0.722229  0.331265
integers         2         3         5         8        13

In [44]:
df.T

                 a         b         c         d         e
team          cubs   pirates    giants   yankees   donkeys
random    0.850584  0.144094  0.611374  0.722229  0.331265
integers         2         3         5         8        13

### to_csv

In [45]:
df.to_csv('teams.csv')

In [46]:
# use the sep option if the separator is not a comma
df.to_csv('teams.tsv', sep='\t')

### read_csv

In [47]:
df1 = pd.read_csv('teams.csv', index_col=0)
df1

      team    random  integers
a     cubs  0.850584         2
b  pirates  0.144094         3
c   giants  0.611374         5
d  yankees  0.722229         8
e  donkeys  0.331265        13

In [48]:
# we can specify the dtypes when we read_csv
df2 = pd.read_csv('teams.csv', index_col=0, dtype=object)
df3 = pd.read_csv('teams.csv', index_col=0, dtype={'team': object, 'random': np.float, 'integers': np.int})

In [49]:
# default datatypes
df1.dtypes

team         object
random      float64
integers      int64
dtype: object

In [50]:
# specify datatypes: all object
df2.dtypes

team        object
random      object
integers    object
dtype: object

In [51]:
# specify datatypes: per column
df3.dtypes

team         object
random      float64
integers      int64
dtype: object

In [52]:
# use the sep option if the separator is not a comma
df4 = pd.read_csv('teams.tsv', index_col=0, sep='\t')
df4

      team    random  integers
a     cubs  0.850584         2
b  pirates  0.144094         3
c   giants  0.611374         5
d  yankees  0.722229         8
e  donkeys  0.331265        13

### to_datetime

We will cover time series in greater detail in a future lesson.

In [53]:
df_sio.head()

            Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
0  11/10/15 1:42      22.307        3.712     33.199     19.95
1  11/10/15 1:35      22.311        3.588     33.201     19.94
2  11/10/15 1:29      22.305        3.541     33.200     19.95
3  11/10/15 1:23      22.323        3.463     33.200     19.95
4  11/10/15 1:17      22.316        3.471     33.199     19.95

In [54]:
time = pd.to_datetime(df_sio['Date'])
time.head()

0   2015-11-10 01:42:00
1   2015-11-10 01:35:00
2   2015-11-10 01:29:00
3   2015-11-10 01:23:00
4   2015-11-10 01:17:00
Name: Date, dtype: datetime64[ns]

In [55]:
df_sio['Date'] = time

In [56]:
df_sio.head()

                 Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
0 2015-11-10 01:42:00      22.307        3.712     33.199     19.95
1 2015-11-10 01:35:00      22.311        3.588     33.201     19.94
2 2015-11-10 01:29:00      22.305        3.541     33.200     19.95
3 2015-11-10 01:23:00      22.323        3.463     33.200     19.95
4 2015-11-10 01:17:00      22.316        3.471     33.199     19.95